#pragma once


#include <windows.h>

//──────────────────────────────────────────────────────
// 화면을 지워주고 커서의 위치를 0,0 으로 이동시키는 함수
//──────────────────────────────────────────────────────
void Clear(void);
//──────────────────────────────────────────────────────
// 커서의 위치를 _x, _y 로 변경하는 함수
//──────────────────────────────────────────────────────
void GotoXY(int _x, int _y);
//──────────────────────────────────────────────────────
// console 창의 title을 변경해 주는 함수
//──────────────────────────────────────────────────────
void SetTitle(char* _szConsoleName);
//──────────────────────────────────────────────────────
// 배경색, 글자색을 변경해 주는 함수
//──────────────────────────────────────────────────────
void SetColor(unsigned char _BgColor, unsigned char _TextColor);
//──────────────────────────────────────────────────────
// cursor를 보이게, 안보이게 하는 함수 
//──────────────────────────────────────────────────────
void SetCursor(BOOL _bShow);
//──────────────────────────────────────────────────────
// console 창의 크기를 정하는 함수 ( 디폴트 80, 25 )
//──────────────────────────────────────────────────────
void SetConsoleSize(int _col, int _lines);

// 그 좌표일때만 적재하고 되돌아가기 -> 그 좌표 기억하기.
// for문으로 가야할지 if문으로 해야하는지 고민
// 또한, 블로그나 동영상 참고하고 나만의 스타일로 만들지 그냥 무작정내가해야하는지



